In [2]:
import pandas as pd
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})
countries_df.index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ']
countries_df

      country  population    square
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

In [4]:
countries_df.mean(axis=0)

C:\Users\Bruda\AppData\Local\Temp\ipykernel_9692\1904880919.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  countries_df.mean(axis=0)

population    9.070000e+01
square        5.800860e+06
dtype: float64

In [5]:
countries_df.population

UK     56.29
CA     38.05
US    322.28
RU    146.24
UA     45.50
BY      9.50
KZ     17.04
Name: population, dtype: float64

In [10]:
countries_df.loc[['UA', 'BY', 'KZ'], ['square', 'population']]

     square  population
UA   603628       45.50
BY   207600        9.50
KZ  2724902       17.04

In [14]:
countries_df.iloc[4:7, 1:3]

    population   square
UA       45.50   603628
BY        9.50   207600
KZ       17.04  2724902

In [16]:
AB = pd.DataFrame({
    'A': [0,1],
    'B': [1,0]
})
AB

   A  B
0  0  1
1  1  0

In [18]:
CD = pd.DataFrame(
    data = [
        [0,1],
        [1,0]
        ],
    columns=['A', 'B']
)
CD

   A  B
0  0  1
1  1  0

In [21]:
actual_income = [478, 512, 196]
actual_expenses = [156, 130, 270]
actual_years = [2018, 2019, 2020]

In [24]:
def create_companyDF(income, expenses, years):
    companyDF = pd.DataFrame({
        'income': income,
        'expences': expenses
    })
    companyDF.index = years
    return companyDF

current_company_df = create_companyDF(actual_income, actual_expenses, actual_years)
current_company_df

      income  expences
2018     478       156
2019     512       130
2020     196       270

In [53]:
def get_profit(current_df, requested_year):
    if requested_year not in current_df.index:
        actual_profit = None
    else:
        actual_profit = current_df.loc[requested_year, 'income'] - current_df.loc[requested_year, 'expences']
    return actual_profit

get_profit(current_company_df, 2020)

-74

In [2]:
import pandas as pd
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})
countries_df.index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ']
countries_df

      country  population    square
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

In [3]:
countries_df.to_csv('data/countries.csv', index=False, sep=';')

In [6]:
countries_data = pd.read_csv('data/countries.csv', sep=';')
countries_data

     country  population    square
0     Англия       56.29    133396
1     Канада       38.05   9984670
2        США      322.28   9826630
3     Россия      146.24  17125191
4    Украина       45.50    603628
5   Беларусь        9.50    207600
6  Казахстан       17.04   2724902

In [7]:
melb_data = pd.read_csv('https://raw.githubusercontent.com/esabunor/MLWorkspace/master/melb_data.csv')